In [23]:
import pandas as pd

In [24]:
df = pd.read_csv('homeprices.csv')

In [25]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [26]:
df['bedrooms'] = df['bedrooms'].fillna(df['bedrooms'].median())

In [27]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [28]:
from sklearn import linear_model

In [29]:
model = linear_model.LinearRegression()

In [30]:
x = df[['area','bedrooms','age']]

In [31]:
x

   area  bedrooms  age
0  2600       3.0   20
1  3000       4.0   15
2  3200       4.0   18
3  3600       3.0   30
4  4000       5.0    8
5  4100       6.0    8

In [32]:
y = df['price']

In [33]:
model.fit(x,y)

LinearRegression()

In [35]:
model.predict([[2600,3.0,20]])

array([518217.63297611])

In [36]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [37]:
df_hiring = pd.read_csv('hiring.csv')

In [38]:
df_hiring

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [39]:
df.shape

(6, 4)